class Flowers {
  int id;
  final String name;
  List<String> fimage;
  final int price;
  final String description;
  final String specifications;
  final String video;
  int quantity;

  Flowers(this.id, this.name, this.fimage, this.price, this.description,
      this.specifications, this.video, this.quantity);
}

List<Flowers> flowersList = [
  Flowers(
      1,
      "Искусственные цветы в горшке Осока 2 шт",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1704891711/lmcode/HWxZQbTsCEil8AYhHQbDEQ/91568924.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1704891711/lmcode/Pt3nd0qavkiGDw9xA74S_Q/91568924_01.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1704891711/lmcode/gsRc9_kmuE2bHLXxWyY-7g/91568924_03.jpg'
      ],
      950,
      "Скучаете по зелени в интерьере, но времени на уход за комнатными растениями не хватает? Искусственные растения идеальное решение для вас! цветы для декора - это не просто альтернатива живым растениям, это возможность оживить ваш интерьер, наполнить его уютом и легкостью. Искусственные цветы в горшке, комнатные растения - все это можно найти в нашем ассортименте. Такой декор для комнаты подойдет как для спальни, так и для кухни. Вы можете разместить горшочки на балконе и террасе, украсить лестничные проемы или фойе, ванную комнату, разместить на кухонной столешнице или подоконнике, оформить фотозону или поднять настроение, установив на рабочем месте. Диаметр горшка 9см, высота с растением 23см. Живые комнатные растения требуют регулярного полива, а искусственные цветы декор радуют глаз без всякого ухода. Красивые комнатные цветы искусственные сочетаются с горшком, создавая единую гармоническую композицию. Хотите добавить в свой дом атмосферу натуры и уюта? Тогда выбирайте искусственные растения. Это отличный декор для дома, который оживит ваш интерьер и наполнит его уютом и теплом. Наше производство Льнянка расположено в Московской области, так что вы можете быть уверены в качестве нашей продукции. У нас вы найдете декоративные цветы и зелень в интерьере, которые подойдут для любого стиля и пространства. Размещайте их в своем доме и наслаждайтесь красотой и душевным теплом, которые они приносят.",
      "Тип продукта - Искусственное растение Вид растения - Декоративное растение Род растений - Роза Цвет - Микс разноцветный Освещение - Подходит для большинства условий освещения Температура - Неприхотливо Удобрение - Нет требуется Страна производства - Китай Упаковка - Полиэтиленовый пакет Высота - Зависит от конкретного вида и стиля розы Вес - Около 100-200 грамм",
      '',
      1),
  Flowers(
      2,
      "Цветок искусственный 13x13x75 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1697475940/lmcode/RAjQW3QrYkK8eV_rmP5QIg/91438483.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1697475940/lmcode/BFEZADGzWUG-QZIntVjwoQ/91438483_02.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1697475940/lmcode/BFEZADGzWUG-QZIntVjwoQ/91438483_02.jpg'
      ],
      415,
      "Искусственные растения – универсальная деталь для декорирования и другого творчества, в отличие от живых они не завянут, не опадут и не требуют тщательного ухода. Букеты из искусственных цветов абсолютно не отличаются от настоящих цветов, благодаря чему они добавят в ваш интерьер легкости и воздушности.",
      "Тип продукта - Искусственное растение; Вид растения - Декоративное растение; Род растений - Роза (Rosa); Цвет - Микс (разноцветный); Освещение - Подходит для большинства условий освещения; Температура - Неприхотливо; Удобрение - Не требуется; Страна производства (если применимо) - Китай; Упаковка - Полиэтиленовый пакет; Высота (в среднем) - Зависит от конкретного вида и стиля розы; Вес (в среднем) - Около 100-200 грамм.",
      '',
      1),
  Flowers(
      3,
      "Искусственные цветы Орхидеи Люкс 5 веток белые латекс 75 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1694124507/lmcode/uJt2F2UieE2GzO9UA13gAg/91369270.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1694124507/lmcode/cqtbwL9MLkGwRECU2tMOXw/91369270_01.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1694124507/lmcode/uJt2F2UieE2GzO9UA13gAg/91369270.jpg'
      ],
      5846,
      "Орхидеи - особый вид цветов, который привлекает внимание своей неповторимой красотой и изящностью. Искусственные орхидеи в кашпо, которые сделаны из силикона или латекса, на ощупь практически неотличимы от живых цветов. Они имеют естественные цвета и великолепно имитируют текстуру и форму натуральных лепестков и листьев. Кроме того, орхидеи отличаются своей универсальностью и могут использоваться в разных помещениях: подходят для оформления как жилых, так и коммерческих интерьеров, идеально дополнят обстановку в комнате, придав ей изысканный и роскошный вид. Искусственные орхидеи в горшках, искусственные пальмы, искусственная ампельная зелень прекрасно вписываются в любой интерьер. Они могут быть размещены в любом уголке помещения, взяв на себя роль изящного украшения и привлекательного акцента. Благодаря своей влагостойкости, они могут использоваться в условиях высокой влажности и будут выглядеть так же свежо и ярко, как и в первый день. Для гостиной искусственные белые орхидеи в высоких кашпо могут стать центральным украшением, это добавит комнате свежести и стиля.",
      "Тип продукта - Искусственное комнатное растение, Тип растения - Цветущее, Род растений - Орхидея, Сорт - Люкс, Цветовая палитра - Белый, Материал - Латекс, Длина - 75 см, Место посадки - Полутень, тень, Допустимая температура - 5-25°, Тип удобрения - Универсальное, Страна производства - Россия, Тип упаковки - Кашпо, Высота товара - 29,5 см, Глубина товара - 10,1 см, Ширина товара - 10,1 см, Вес товара - 0,372 кг.",
      '',
      1),
  Flowers(
      4,
      "Искусственные цветы Орхидеи 5 веток белые латекс 75 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1694124506/lmcode/NYBYWVJyoEerFA55GcENcQ/91369274.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1694124506/lmcode/Id-GDginyUCJYjdBk0oxpg/91369274_01.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1694124506/lmcode/Id-GDginyUCJYjdBk0oxpg/91369274_01.jpg'
      ],
      5544,
      "Орхидеи - особый вид цветов, который привлекает внимание своей неповторимой красотой и изящностью. Искусственные орхидеи в кашпо, которые сделаны из силикона или латекса, на ощупь практически неотличимы от живых цветов. Они имеют естественные цвета и великолепно имитируют текстуру и форму натуральных лепестков и листьев. Кроме того, орхидеи отличаются своей универсальностью и могут использоваться в разных помещениях: подходят для оформления как жилых, так и коммерческих интерьеров, идеально дополнят обстановку в комнате, придав ей изысканный и роскошный вид. ",
      "Тип продукта - Искусственное комнатное растение, Цветущая орхидея, Род растения - Орхидея, Белый цвет, Натуральный латекс, Длина растения - 75 см, Полутенистое или тенистое место, 5-25 °C, Универсальное удобрение, Сделано в России, Продается в кашпо, 29.5 см в высоту, 10.1 см в глубину, 10.1 см в ширину, 372 г.",
      '',
      1),
  Flowers(
      5,
      "Цветок декоративный Гербера цвет ярко-красный 57 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938513/lmcode/L4dZvSWJbEi1G3GhiOezWg/91400169.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938513/lmcode/L4dZvSWJbEi1G3GhiOezWg/91400169.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938513/lmcode/L4dZvSWJbEi1G3GhiOezWg/91400169.jpg'
      ],
      52325,
      "Искусственные цветы - идеальный способ декорирования и украшения любого помещения или рабочей зоны, а также для использования в качестве аксессуара или украшения к празднику. Они могут быть использованы для любого вида творчества или в качестве подарка. Поставьте цветы в вазу или кашпо, и они придадут вашему интерьеру новые краски и создадут уютную атмосферу. Также отлично подойдут для оформления кафе, банкетных залов, салонов красоты и тд. Искусственная ветка Калина выполнена из высококачественных гипоаллергенных материалов, что делает их идеальными для использования в любом помещении. ",
      "Тип продукта: Декоративный цветок, Название: Гербера, Размер: 57 см, Цвет: Ярко-красный, Форма: Цветок, Использование: Интерьерное украшение, Свет: При разном освещении, Температура: 5-25 градусов, Не требует удобрения, Страна производитель: Россия, Без упаковки, Вес: 372 г",
      '',
      1),
  Flowers(
      6,
      "Цветок декоративный Пион 2 бутона 56 см ",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938462/lmcode/W4BrIh5YikCqMIBdg99BSA/91400052.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938462/lmcode/W4BrIh5YikCqMIBdg99BSA/91400052.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938462/lmcode/W4BrIh5YikCqMIBdg99BSA/91400052.png'
      ],
      275885,
      "Искусственные цветы - идеальный способ декорирования и украшения любого помещения или рабочей зоны, а также для использования в качестве аксессуара или украшения к празднику. Они могут быть использованы для любого вида творчества или в качестве подарка. Поставьте цветы в вазу или кашпо, и они придадут вашему интерьеру новые краски и создадут уютную атмосферу. Также отлично подойдут для оформления кафе, банкетных залов, салонов красоты и тд. Искусственная ветка Калина выполнена из высококачественных гипоаллергенных материалов, что делает их идеальными для использования в любом помещении.",
      "Тип продукта: Декоративный цветок; Название: Пион; Количество бутонов: 2; Высота: 56 см; Основной цвет: Бургундский; Форма: Цветок; Использование: Интерьер; Освещение: Подходит для разных условий освещения; Температура: Подходит для комнат в диапазоне температур 5-25°C; Удобрение: Не требует; Страна производства: Россия; Упаковка: Продается без индивидуальной упаковки; Вес: Около 372 грамм.",
      '',
      1),
  Flowers(
      7,
      "Маргаритка 15 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1590500591/lmcode/eh4q1EvSukKQ2Rn9JhhnXQ/82560429.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1590500591/lmcode/eh4q1EvSukKQ2Rn9JhhnXQ/82560429.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1590500591/lmcode/eh4q1EvSukKQ2Rn9JhhnXQ/82560429.png'
      ],
      132,
      "Тип продукта - Комнатный цветок, Род - Маргаритка, Семейство - Астровые, Вид - Bellis perennis, Цвет - Белый, Период цветения - Весна, лето, осень, Освещение - Солнце, полутень, Температура - Умеренная, Влажность - Умеренная, Почва - Нейтральная, плодородная, Размножение - Семенами, делением куста, Применение - В ландшафтном дизайне, в букетах, Диаметр цветка - 4-6 см",
      "Тип продукта - Комнатное растение; Тип растения - Цветущее растение; Род растений - Примула; Цветовая палитра - Разноцветный; Цвет листвы - Зеленый; Высота растения max (см) - 15; Место посадки - Освещение; Допустимая температура (° C) - От 15 до 20°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Универсальное удобрение, подходит для комнатных растений; Страна производства - Россия; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 18; Глубина товара в индивидуальной упаковке (см) - 10.8; Ширина товара в индивидуальной упаковке (см) - 10.8; Вес товара в индивидуальной упаковке (кг) - 0.43",
      '',
      1),
  Flowers(
      8,
      "Спирея микс",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1683814384/lmcode/ZTZVNiLoDku73-Y8POtsAw/85325003.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1683814384/lmcode/Mlb7IAtlSkmu5OGx98M3cg/85325003_01.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1683814389/lmcode/5bg39IGwokqszhB8rYE6cQ/85325003_tag.png'
      ],
      955,
      "Спирея японская Альбифлора - белоцветковый сорт спиреи японской (в то время как почти у всех летнецветущих спирей цветки красных и розовых оттенков). Цветет с июля по сентябрь. Куст невысокий, всего 0,5-0,8 м в высоту и 0,5 – 1,0 м в ширину. Крона компактная, плотная, куполовидная, с поднятыми ветвями.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Гербера; Тип удобрения - Универсальное удобрение, подходит для комнатных растений; Страна производства - Россия; Высота товара в индивидуальной упаковке (см) - 40; Глубина товара в индивидуальной упаковке (см) - 30; Ширина товара в индивидуальной упаковке (см) - 24; Вес товара в индивидуальной упаковке (кг) - 0.775",
      '',
      1),
  Flowers(
      9,
      "Искусственный цветок Роза 64 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1710114653/lmcode/AtO1slCx70SmsHxq9GTPKg/91637507.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1710114653/lmcode/iJ11RWyXekqzvrus0r44Hg/91637507_01.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1710114653/lmcode/AtO1slCx70SmsHxq9GTPKg/91637507.png'
      ],
      300,
      "Декоративные розы впишутся в любой интерьер дома или офиса. Одним из главных преимуществ данных цветов, что они могут сочетаться с любыми другими видами искусственных цветов и живых растений для создания собственных композиций. Не требует никакого ухода. Для чистки можно просто смыть водой. Данные  искусственной розы прекрасно выглядят, как в вазах, так и горшочках и кашпо.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Орхидея; Род растений - Фаленопсис; Сорт - Микс; Цвет листвы - Зеленый; Высота растения max (см) - 75; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 30°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Удобрение для орхидей; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 58.1; Глубина товара в индивидуальной упаковке (см) - 11.2; Ширина товара в индивидуальной упаковке (см) - 11.2; Вес товара в индивидуальной упаковке (кг) - 0.597",
      '',
      1),
  Flowers(
      10,
      "Искусственные цветы в горшке Лаванда 4 шт",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1704891703/lmcode/AC9t8LAiC0qo5dLBoLOxaw/91568879.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1704891703/lmcode/4JPM0lTFskakJ7xokKwm-w/91568879_01.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1704891703/lmcode/M0Lvq27jb0SKpe16A49wmQ/91568879_03.jpg'
      ],
      1550,
      "Скучаете по зелени в интерьере, но времени на уход за комнатными растениями не хватает? Искусственные растения идеальное решение для вас! цветы для декора - это не просто альтернатива живым растениям, это возможность оживить ваш интерьер, наполнить его уютом и легкостью. Искусственные цветы в горшке, комнатные растения - все это можно найти в нашем ассортименте. Такой декор для комнаты подойдет как для спальни, так и для кухни. Вы можете разместить горшочки на балконе и террасе, украсить лестничные проемы или фойе, ванную комнату, разместить на кухонной столешнице или подоконнике, оформить фотозону или поднять настроение, установив на рабочем месте. Диаметр горшка 9см, высота с растением 23см. Живые комнатные растения требуют регулярного полива, а искусственные цветы декор радуют глаз без всякого ухода.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Орхидея; Род растений - Фаленопсис; Сорт - Микс; Цвет листвы - Зеленый; Высота растения max (см) - 75; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 30°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Удобрение для орхидей; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 50.4; Глубина товара в индивидуальной упаковке (см) - 11; Ширина товара в индивидуальной упаковке (см) - 11; Вес товара в индивидуальной упаковке (кг) - 0.423",
      '',
      1),
  Flowers(
      11,
      "Искусственные цветы Орхидеи 3 ветки синие латекс 65см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1682429205/lmcode/g0wlS7_zzk2GYfOlQ0mEAw/91078317.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1682429205/lmcode/QsebOcUg-ECoqOX5evvMPg/91078317_01.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1682429205/lmcode/QsebOcUg-ECoqOX5evvMPg/91078317_01.jpg'
      ],
      3551,
      "Искусственные орхидеи из латекса в кашпо будут оригинальным подарком к любому празднику! Орхидеи станут отличным украшением интерьера. Размер орхидей в кашпо ВхШхГ: 65х40х30. Также в нашем ассортименте Вы найдете красивые искусственные цветы и зелень в горшках для декора, орхидеи из латекса, интерьерные композиции, искусственные растения из латекса, декоративные деревья зеленые и пестролистные, драцены и декоративные пальмы в горшке, оригинальные подвесные композиции с зеленью и цветами, а также искусственный бамбук, фикусы и редкую роскошную Алоказию в кашпо.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Растение в ассортименте; Сорт - Микс; Цветовая палитра - Красный; Цвет листвы - Зеленый; Цвет плодов - Без фруктов; Высота растения max (см) - 40; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 25°; Частота подкормки (среднее значение) - 1 раз в две недели; Тип удобрения - Удобрение для цветущих растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 41.6; Глубина товара в индивидуальной упаковке (см) - 12.8; Ширина товара в индивидуальной упаковке (см) - 12.6; Вес товара в индивидуальной упаковке (кг) - 0.438",
      '',
      1),
  Flowers(
      12,
      "Орхидея Дендробиум Аполлон h50 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1575886527/lmcode/fTQX7a6YBUS1ss0yLI1jNQ/82399656.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1575886528/lmcode/klMC1bRIW0mHMgd12EBxAw/82399656_01.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1575886537/lmcode/q3CfJADUDEOp1A2EI-kghg/82399656_03.png'
      ],
      2998,
      "Дендробиум — один из наиболее многочисленных родов в семействе Орхидных. Дендробиумы характеризуются продолжительным цветением в домашних условиях. Обладают приятными ароматами. Растения уверенно лидируют в рейтинге популярности комнатных цветов. Уход за ними не прост. Светолюбив. Дендробиумам необходима высокая влажность воздуха. Обильный полив во время активного роста (теплый душ или погружение горшка в воду) при наступлении периода покоя сводится к редким водным процедурам по мере полного высыхания земляного кома. Подкормка специальными удобрениями проводится только в течение периода вегетации и полностью прекращается по окончании цветения.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Орхидея; Род растений - Дендробиум; Сорт - Аполлон; Место посадки - Освещение; Допустимая температура (° C) - От 15 до 25°; Тип удобрения - Удобрение для орхидей; Страна производства - Россия; Тип упаковки - Банка/Горшок; Высота товара в индивидуальной упаковке (см) - 48.9; Глубина товара в индивидуальной упаковке (см) - 11; Ширина товара в индивидуальной упаковке (см) - 11; Вес товара в индивидуальной упаковке (кг) - 0.504",
      '',
      1),
  Flowers(
      13,
      "Гортензия Макрофила микс h22 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1565766851/lmcode/onWVZfrH8k6xgWhQ7WakRA/14447938.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1551276703/lmcode/0fX-mZb62Uy3FIMxt8XSfg/14447938_01.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1634560261/lmcode/O1YVOoXLoEKaUbgvLyfkmQ/14447938_i_01.jpg'
      ],
      1555,
      "Гортензия Макрофила микс подходит для декорирования комнаты, офиса, веранды, лоджии. Декоративное растение подходит для выращивания в горшке, контейнере, в открытом грунте. Однако следует предусмотреть под него специальный грунт из торфа, песка и компоста. Требует обильного и регулярного полива. Кустарник нельзя обрезать, соцветия формируются на побегах прошлого года, удаляются только больные веточки.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Гортензия; Сорт - Макрофила; Цвет листвы - Зеленый; Высота растения max (см) - 22; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 10 до 25°; Частота подкормки (среднее значение) - 1 раз в две недели; Тип удобрения - Удобрение для цветущих растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 22; Глубина товара в индивидуальной упаковке (см) - 10.5; Ширина товара в индивидуальной упаковке (см) - 10.5; Вес товара в индивидуальной упаковке (кг) - 0.35",
      '',
      1),
  Flowers(
      14,
      "Орхидея Фаленопсис Солид Голд h60 см желтый",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1679059743/lmcode/nEqoSltimkqEXDi2LgHfMA/86720757.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1679059743/lmcode/glDJggAdv0uIDEtfVL1vXg/86720757_02.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1679059743/lmcode/FCVFXBZVhEmcEsovz4eN-Q/86720757_03.png'
      ],
      2555,
      "Фаленопсис Солид голд можно назвать настоящим золотом, растение способствует развитию у ее владельца практичности, а также интуиции, значительно повышает ментальные способности, логическое мышление. Это комнатное растение великолепно подойдет для подарка мужчине или женщине. Фаленопсис Солид голд — неприхотливое вечнозеленое растение, цветущее практически круглый год, идеально подходит для начинающих цветоводов.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Орхидея; Род растений - Фаленопсис; Сорт - Солид Голд; Цвет листвы - Зеленый; Высота растения max (см) - 80; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 30°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Удобрение для орхидей; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 60.1; Глубина товара в индивидуальной упаковке (см) - 11.5; Ширина товара в индивидуальной упаковке (см) - 11.5; Вес товара в индивидуальной упаковке (кг) - 0.382",
      '',
      1),
  Flowers(
      15,
      "Каланхое махровый микс h17 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1590063244/lmcode/1fhhB00uSUiFCaPjzOEdDQ/13974314.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1553183298/lmcode/VWR6lnibh0aARW7RICGYbg/13974314_01.png',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1553183302/lmcode/tqSGPOJkokG36qkAnQMAYg/13974314_03.png'
      ],
      498,
      "Каланхое махровый микс — неприхотливое декоративное комнатное растение. Отлично адаптируется к условиям произрастания, обильно цветет на протяжении долгого времени. Выглядит как компактный кустик с плотными глянцевыми листьями округлой формы, резными по краю. В высоту не вырастает более 30 см. Цветет собранными в соцветия-корзинки небольшими ажурными цветками. В зависимости от сорта они могут быть белого, розового, красного, желтого цветов.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Каланхое; Сорт - Микс; Место посадки - Освещение; Допустимая температура (° C) - От 15 до 30°; Тип удобрения - Удобрение для комнатных растений; Страна производства - Россия; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 20.6; Глубина товара в индивидуальной упаковке (см) - 8.3; Ширина товара в индивидуальной упаковке (см) - 8.3; Вес товара в индивидуальной упаковке (кг) - 0.299",
      '',
      1),
  Flowers(
      16,
      "Искусственный цветок Кореопсис 50 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1684839930/lmcode/z7UAe8DAFkCYTNM-9wEyOQ/91113784.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1684839930/lmcode/z7UAe8DAFkCYTNM-9wEyOQ/91113784.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1684839930/lmcode/z7UAe8DAFkCYTNM-9wEyOQ/91113784.jpg'
      ],
      400,
      "Композиции из искусственных полевых цветов станут приятным напоминанием о безмятежном лете и семейном отдыхе на природе. При этом специального ухода такие цветы не требуют: просто регулярно протирайте их влажной тканью или промывайте водой.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Рододендрон; Сорт - Микс; Цвет листвы - Зеленый; Высота растения max (см) - 20; Место посадки - Освещение; Допустимая температура (° C) - От 15 до 30°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Удобрение для декоративно-цветущих; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 18.9; Глубина товара в индивидуальной упаковке (см) - 9.7; Ширина товара в индивидуальной упаковке (см) - 9.7; Вес товара в индивидуальной упаковке (кг) - 0.265",
      '',
      1),
  Flowers(
      17,
      "Цветок искусственный 115x7x7 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1651335874/lmcode/O9WZhsaeQEe1aLZRlpEb1A/90360748.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1651335875/lmcode/AThqXVWx302h-8qizUY9TQ/90360748_01.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1651335875/lmcode/SERenFeYdUeUVDhRmSEm3Q/90360748_02.jpg'
      ],
      340,
      "Искусственные растения – универсальная деталь для декорирования и другого творчества, в отличие от живых они не завянут, не опадут и не требуют тщательного ухода. Букеты из искусственных цветов абсолютно не отличаются от настоящих цветов, благодаря чему они добавят в ваш интерьер легкости и воздушности. Представлен в 3 вариантах",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Гузмания; Сорт - Раннер Блитз; Цвет листвы - Зеленый; Цвет плодов - Без фруктов; Высота растения max (см) - 25; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 25°; Частота подкормки (среднее значение) - 1 раз в две недели; Тип удобрения - Удобрение для цветущих растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 39.8; Глубина товара в индивидуальной упаковке (см) - 8.7; Ширина товара в индивидуальной упаковке (см) - 8.6; Вес товара в индивидуальной упаковке (кг) - 0.402",
      '',
      1),
  Flowers(
      18,
      "Цветок искусственный в горшке Gloria Garden Белые ромашки 40 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1650548551/lmcode/fCIMLkOTd0WzVqcA_T9UIg/90347151.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1650548551/lmcode/fCIMLkOTd0WzVqcA_T9UIg/90347151.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1650548551/lmcode/fCIMLkOTd0WzVqcA_T9UIg/90347151.jpg'
      ],
      675,
      "Цветок искусственный в горшке Белые ромашки, 40 см, Gloria Garden Дополнительные подробности: диаметр горшка: 7см, высота горшка - 19,5 см. Комплектация: композиция - 1 шт Размер штуки: 7,5х7,5х40 см Размер товара в упаковке: 8х8х40 см Материал: пластик, текстиль. Вид упаковки: упаковочный пакет.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Калла; Сорт - Калла; Цвет листвы - Зеленый; Высота растения max (см) - 65; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 30°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Универсальное удобрение, подходит для комнатных растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 43.8; Глубина товара в индивидуальной упаковке (см) - 11.2; Ширина товара в индивидуальной упаковке (см) - 11.2; Вес товара в индивидуальной упаковке (кг) - 0.449",
      '',
      1),
  Flowers(
      19,
      "Цветок декоративный Орхидея 10 бутонов 82 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938492/lmcode/kBNad0rOrE6bwIkS85Eflw/91400118.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938492/lmcode/kBNad0rOrE6bwIkS85Eflw/91400118.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1695938492/lmcode/kBNad0rOrE6bwIkS85Eflw/91400118.jpg'
      ],
      165485,
      "Искусственные цветы - идеальный способ декорирования и украшения любого помещения или рабочей зоны, а также для использования в качестве аксессуара или украшения к празднику. Они могут быть использованы для любого вида творчества или в качестве подарка. Поставьте цветы в вазу или кашпо, и они придадут вашему интерьеру новые краски и создадут уютную атмосферу. Также отлично подойдут для оформления кафе, банкетных залов, салонов красоты и тд. Искусственная ветка Калина выполнена из высококачественных гипоаллергенных материалов, что делает их идеальными для использования в любом помещении. Цветок изготовлен из текстиля и пластика, устойчивого к выгоранию на солнце, а также к дождю и ветру, поэтому его можно использовать как внутри помещения, так и на открытом воздухе. Он подходят для круглогодичной установки на кладбище на могиле, в качестве отдельно стоящих композиций или в венках. Декоративные цветы изготовлены из качественного плотного и долговечного текстиля. Высота искусственной ветки составляет 30 см. Важно отметить, что при доставке искусственные цветы могут помяться, поэтому после получения рекомендуется расправить букет или цветок и, при необходимости, встряхнуть и подержать над паром или обдуть феном.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Растение в ассортименте; Сорт - Микс; Цвет листвы - Зеленый; Высота растения max (см) - 20; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 10 до 25°; Частота подкормки (среднее значение) - 1 раз в две недели; Тип удобрения - Удобрение для цветущих растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 19.1; Глубина товара в индивидуальной упаковке (см) - 8.8; Ширина товара в индивидуальной упаковке (см) - 8.8; Вес товара в индивидуальной упаковке (кг) - 0.152",
      '',
      1),
  Flowers(
      20,
      "Цветок искусственный 13x13x75 см",
      [
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1697475940/lmcode/RAjQW3QrYkK8eV_rmP5QIg/91438483.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1697475940/lmcode/OZLv_YN6nkmO28Lh5Pr8Yw/91438483_01.jpg',
        'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_1.0/c_pad/w_200/h_200/v1697475940/lmcode/BFEZADGzWUG-QZIntVjwoQ/91438483_02.jpg'
      ],
      415,
      "Искусственные растения – универсальная деталь для декорирования и другого творчества, в отличие от живых они не завянут, не опадут и не требуют тщательного ухода. Букеты из искусственных цветов абсолютно не отличаются от настоящих цветов, благодаря чему они добавят в ваш интерьер легкости и воздушности.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Роза; Сорт - Микс; Цвет листвы - Зеленый; Высота растения max (см) - 35; Место посадки - Под прямым солнцем; Допустимая температура (° C) - От 10 до 15°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Универсальное удобрение, подходит для комнатных растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 15.2; Глубина товара в индивидуальной упаковке (см) - 5.9; Ширина товара в индивидуальной упаковке (см) - 5.9; Вес товара в индивидуальной упаковке (кг) - 0.073",
      '',
      1)
];
List<Flowers> cart = [];
List<Flowers> like = [];
